//=============================================================================
//
// プレイヤーマネージャーの処理 [playermanager.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "scene.h"
#include "player.h"

//*****************************************************************************
// 構造体
//*****************************************************************************


class CPlayer;
//*********************************************************
// プレイヤーマネージャークラス
//*********************************************************
class CPlayerManager
{
public:
	CPlayerManager();
	~CPlayerManager();

	HRESULT Init(void);
	void Uninit(void);	

	CPlayer *GetPlayer(void) { return m_pPlayer; }

protected:
	CPlayer * m_pPlayer;
};
